artillery-tests/users-tests/puts/update_user.yaml
config:
    target: http://127.0.0.1:8080/tukano-1/rest
    phases:
        - name: simple_put
          duration: 1
          arrivalRate: 1
scenarios:
    - name: TuKanoUpdate
      flow:
        - put:
            url: /users/teste?pwd=testando
            headers:
                Content-Type: application/json
            json:
                id: "NewId"
                pwd: "NewPass"
                email: "kratos@gmail.com"
                displayName: "Spartan"